; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v10)
             (pred_1 ?v13 ?v2)
             (pred_7 ?v3 ?v2)
             (pred_2 ?v9 ?v3 )
	     (pred_3 ?v3)
             (pred_6 ?v11)
             (pred_12 ?v13)
             (pred_10 ?v2)
             (pred_11 ?v3)
             (pred_5 ?v13)
             (pred_9 ?v3)
             (pred_4 ))



(:action op_4
:parameters (?v7 ?v6 ?v4 ?v12)
:precondition (and (pred_6 ?v7) (pred_6 ?v6) (pred_12 ?v4) (pred_10 ?v12)
          (pred_8 ?v7 ?v6) (pred_1 ?v4 ?v12)
                   (pred_7 ?v6 ?v12) (pred_3 ?v7) 
                   (pred_11 ?v6) (pred_5 ?v4))
:effect (and  (pred_9 ?v6) (not (pred_11 ?v6))))


(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_6 ?v7) (pred_6 ?v1)
               (pred_3 ?v7) (pred_8 ?v7 ?v1) (pred_9 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v7))))

(:action op_3
:parameters (?v7 ?v4)
:precondition (and (pred_6 ?v7) (pred_12 ?v4) 
                  (pred_3 ?v7) (pred_2 ?v4 ?v7) (pred_4 ))
:effect (and (pred_5 ?v4)
   (not (pred_2 ?v4 ?v7)) (not (pred_4 ))))


(:action op_5
:parameters (?v7 ?v8 ?v5)
:precondition (and (pred_6 ?v7) (pred_12 ?v8) (pred_12 ?v5)
                  (pred_3 ?v7) (pred_5 ?v5) (pred_2 ?v8 ?v7))
:effect (and (pred_5 ?v8) (pred_2 ?v5 ?v7)
        (not (pred_5 ?v5)) (not (pred_2 ?v8 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_6 ?v7) (pred_12 ?v4) 
                  (pred_3 ?v7) (pred_5 ?v4))
:effect (and (pred_4 ) (pred_2 ?v4 ?v7) (not (pred_5 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_19 obj_14 obj_15 obj_04 obj_18 obj_10 obj_07 obj_09 obj_21 obj_01 obj_16 obj_13 obj_20 obj_06 obj_12
    obj_03 obj_05
    obj_11 obj_08 obj_02
    )

    (:init
       (pred_4)

       (pred_6 obj_17)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_09)
       (pred_6 obj_21)
       (pred_6 obj_01)
       (pred_6 obj_16)
       (pred_6 obj_13)
       (pred_6 obj_20)
       (pred_6 obj_06)
       (pred_6 obj_12)
       (pred_10 obj_03)
       (pred_10 obj_05)
       (pred_12 obj_11)
       (pred_12 obj_08)
       (pred_12 obj_02)

       (pred_8 obj_17 obj_04)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_14 obj_15)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_17)
       (pred_8 obj_18 obj_21)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_18 obj_19)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_10 obj_07)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_09 obj_13)
       (pred_8 obj_09 obj_21)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_21 obj_01)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_21 obj_09)
       (pred_8 obj_01 obj_06)
       (pred_8 obj_01 obj_16)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_01 obj_21)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_16 obj_01)
       (pred_8 obj_13 obj_20)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_20 obj_13)
       (pred_8 obj_06 obj_12)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_12 obj_06)
       (pred_11 obj_18)
       (pred_11 obj_20)
       (pred_11 obj_07)
       (pred_7  obj_18 obj_03)
       (pred_7  obj_20 obj_05)
       (pred_7  obj_07 obj_05)
       (pred_9 obj_17)
       (pred_9 obj_19)
       (pred_9 obj_14)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_10)
       (pred_9 obj_09)
       (pred_9 obj_21)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_13)
       (pred_9 obj_06)
       (pred_9 obj_12)

       (pred_1  obj_11 obj_03)
       (pred_1  obj_08 obj_05)
       (pred_1  obj_02 obj_05)
       (pred_2 obj_11 obj_19)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_02 obj_16)
       (pred_3 obj_09)
    )

    (:goal (and
       (pred_2 obj_02 obj_06)
    ))
(:constraints
  (always (not (pred_3 obj_21)))
)
)

; plan
1. (op_2 obj_09 obj_04)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_04)
   goals met: 0 of 1
2. (op_2 obj_04 obj_17)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_17)
   goals met: 0 of 1
3. (op_2 obj_17 obj_19)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_19)
   goals met: 0 of 1
4. (op_2 obj_19 obj_14)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_14)
   goals met: 0 of 1
5. (op_2 obj_14 obj_10)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_10)
   goals met: 0 of 1
6. (op_2 obj_10 obj_01)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_01)
   goals met: 0 of 1
7. (op_2 obj_01 obj_16)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_16)
   goals met: 0 of 1
8. (op_3 obj_16 obj_02)
   deleted: (pred_2 obj_02 obj_16) (pred_4)
   added: (pred_5 obj_02)
   goals met: 0 of 1
9. (op_2 obj_16 obj_01)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_01)
   goals met: 0 of 1
10. (op_2 obj_01 obj_06)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_06)
   goals met: 0 of 1
11. (op_1 obj_06 obj_02)
   deleted: (pred_5 obj_02)
   added: (pred_4) (pred_2 obj_02 obj_06)
   goals met: 1 of 1
